[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "Snake Plant, also known as Sansevieria, is one of the most resilient and low-maintenance indoor plants. It purifies the air by removing toxins such as formaldehyde and benzene, making it ideal for bedrooms and living rooms. This plant thrives in low light and requires minimal watering, making it perfect for beginners or busy households. Its tall, upright leaves add a sleek, modern aesthetic to any indoor space. Snake plants also release oxygen at night, improving sleep quality. With occasional fertilization and indirect sunlight, this plant can grow several feet tall over the years.",
    "image": "https://i.ibb.co.com/0pLks5LX/air-purifier1.webp",
    "providerName": "UrbanGreen Studio",
    "plantOfTheWeek" : true
  },
  {
    "plantId": 2,
    "plantName": "Aloe Vera",
    "category": "Medicinal",
    "price": 12,
    "rating": 4.6,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "Aloe Vera is a succulent plant celebrated for its medicinal properties and air-purifying qualities. Its thick, fleshy leaves contain gel that can soothe burns, cuts, and dry skin. Aloe thrives in bright, indirect sunlight and requires minimal watering, making it an ideal plant for homes and offices. Beyond its healing gel, Aloe Vera helps remove harmful chemicals from indoor air and adds a touch of natural greenery. This plant is perfect for countertops, windowsills, or as a decorative piece in modern interiors. Its minimal maintenance and natural beauty make it a popular choice for plant enthusiasts.",
    "image": "https://i.ibb.co.com/sd3X9PJF/medicinal-1.webp",
    "providerName": "GreenLeaf Nursery"
  },
  {
    "plantId": 3,
    "plantName": "Peace Lily",
    "category": "Flowering",
    "price": 25,
    "rating": 4.7,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "Peace Lily is an elegant flowering plant that produces pristine white blooms, adding sophistication to any indoor space. It thrives in medium light and prefers high humidity, making it ideal for living rooms, offices, or bathrooms. Peace Lilies filter airborne toxins, such as mold spores and VOCs, improving indoor air quality. Its glossy green leaves and delicate flowers create a striking contrast that elevates interior decor. Regular watering keeps it vibrant, while occasional fertilization encourages more blooms. This plant is a blend of beauty and functionality, perfect for those who want aesthetic appeal along with cleaner air.",
    "image": "https://i.ibb.co.com/ymXjz43r/flowering-1.webp",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 4,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 15,
    "rating": 4.5,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "Spider Plant is a resilient and easy-to-care-for houseplant that features long arching leaves and produces baby plantlets that can be propagated easily. It thrives in indirect light and moderate humidity and can survive in a variety of indoor conditions. Spider Plants are natural air purifiers, removing pollutants like carbon monoxide and formaldehyde. Their cascading foliage creates a lush and dynamic visual, making them perfect for hanging baskets, shelves, or plant stands. Regular watering and occasional trimming ensure a full, healthy appearance. This plant is excellent for beginners or anyone looking to add greenery to their indoor environment without much effort.",
    "image": "https://i.ibb.co.com/6c6xPPPn/air-purifier-2.webp",
    "providerName": "HomeGarden Co."
  },
  {
    "plantId": 5,
    "plantName": "Fiddle Leaf Fig",
    "category": "Ornamental",
    "price": 40,
    "rating": 4.4,
    "availableStock": 5,
    "careLevel": "Medium",
    "description": "Fiddle Leaf Fig is a popular ornamental plant recognized for its large, violin-shaped leaves and striking presence indoors. It prefers bright, indirect sunlight and consistent watering to keep its leaves healthy and vibrant. Its bold foliage and dramatic vertical growth make it an ideal centerpiece for living rooms, offices, or entryways. While it requires moderate care, including occasional pruning and dusting of its leaves, the visual impact is unmatched. This plant adds a tropical touch to interiors and complements modern and contemporary decor. Properly maintained, it can become a long-term statement plant for any indoor space.",
    "image": "https://i.ibb.co.com/fG8M9pW1/ornamental.webp",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 6,
    "plantName": "Monstera Deliciosa",
    "category": "Ornamental",
    "price": 35,
    "rating": 4.6,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "Monstera Deliciosa, often called the Swiss Cheese Plant, is renowned for its large, split leaves that add a tropical and exotic look to any interior. It thrives in bright, indirect light and requires moderate watering. Its unique leaf patterns create a visually striking focal point, perfect for living spaces, offices, or lounges. Monsteras also improve air quality while bringing a lush, jungle-like vibe indoors. Regular pruning encourages fuller growth, and providing support stakes helps manage its height. This ornamental plant blends aesthetic appeal with easy indoor adaptability, making it a favorite among plant enthusiasts.",
    "image": "https://i.ibb.co.com/S4jZM0k7/ornamental-2.webp",
    "providerName": "GreenLeaf Nursery"
  },
  {
    "plantId": 7,
    "plantName": "Boston Fern",
    "category": "Air Purifier",
    "price": 20,
    "rating": 4.3,
    "availableStock": 10,
    "careLevel": "Medium",
    "description": "Boston Fern is a lush, feathery plant that thrives in humid environments and indirect sunlight. It is known for its exceptional air-purifying abilities, removing pollutants such as formaldehyde and xylene. Its soft, cascading fronds create a natural, verdant aesthetic suitable for bathrooms, kitchens, or shaded living areas. Regular misting and consistent moisture keep the fronds healthy, while trimming maintains shape and fullness. Boston Ferns are ideal for creating a natural, calming atmosphere and adding texture and depth to indoor spaces. With care, they can grow into dense, vibrant greenery.",
    "image": "https://i.ibb.co.com/v660z6wz/air-purifier-3.webp",
    "providerName": "HomeGarden Co."
  },
  {
    "plantId": 8,
    "plantName": "Rubber Plant",
    "category": "Ornamental",
    "price": 28,
    "rating": 4.5,
    "availableStock": 7,
    "careLevel": "Easy",
    "description": "Rubber Plant is a glossy-leaf ornamental plant prized for its vertical growth and decorative foliage. It thrives in bright, indirect sunlight and tolerates moderate watering, making it a low-maintenance indoor choice. Its thick, shiny leaves not only add elegance but also contribute to air purification by removing toxins. Rubber Plants can grow tall over time, serving as a living indoor tree. Occasional leaf cleaning and pruning promote healthier growth and maintain its striking appearance. Perfect for living rooms, offices, or hallways, it adds structure and greenery to any space.",
    "image": "https://i.ibb.co.com/TBjPYk90/ornamental-3.webp",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 9,
    "plantName": "Pothos",
    "category": "Air Purifier",
    "price": 16,
    "rating": 4.7,
    "availableStock": 14,
    "careLevel": "Easy",
    "description": "Pothos is a versatile trailing vine that grows well in low light and requires minimal maintenance. Its heart-shaped leaves are highly decorative, making it ideal for hanging baskets, shelves, or wall-mounted planters. Pothos effectively cleans indoor air by removing toxins and is resilient to occasional neglect. Pruning encourages bushier growth and keeps vines manageable. This plant is perfect for beginners or anyone looking to add a lush, cascading greenery indoors. It also tolerates various container sizes, making it adaptable to different spaces.",
    "image": "https://i.ibb.co.com/gbQK6nF9/air-purifier-4.webp",
    "providerName": "GreenLeaf Nursery"
  },
  {
    "plantId": 10,
    "plantName": "ZZ Plant",
    "category": "Air Purifier",
    "price": 22,
    "rating": 4.6,
    "availableStock": 9,
    "careLevel": "Easy",
    "description": "ZZ Plant is a low-maintenance indoor plant with glossy, dark green leaves that thrive in low-light conditions. It is highly drought-tolerant and requires minimal care, making it ideal for offices, apartments, and low-light rooms. ZZ Plants also improve indoor air quality and add a touch of sophistication to any space. Regular dusting keeps leaves shiny, and occasional watering ensures steady growth. Its upright growth habit and attractive foliage make it a perfect decorative plant for corners, shelves, or desks, providing greenery without much effort.",
    "image": "https://i.ibb.co.com/5h2MjqFh/air-purifier-5.webp",
    "providerName": "HomeGarden Co."
  },
  {
    "plantId": 11,
    "plantName": "Orchid",
    "category": "Flowering",
    "price": 30,
    "rating": 4.8,
    "availableStock": 5,
    "careLevel": "Medium",
    "description": "Orchid is an exotic flowering plant known for its delicate, elegant blooms and vibrant colors. It thrives in bright, indirect sunlight with moderate humidity. Orchids bring sophistication and charm to any indoor space, making them ideal for tables, shelves, or windowsills. Regular watering and fertilization encourage long-lasting flowers. With proper care, orchids can bloom multiple times a year, providing beauty and fragrance. Their intricate blossoms and graceful stems make them a favorite among plant enthusiasts and interior decorators alike.",
    "image": "https://i.ibb.co.com/BVsV7YHG/flowering-2.webp",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 12,
    "plantName": "Insulin Plant",
    "category": "Medicinal",
    "price": 24,
    "rating": 4.5,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "Insulin Plant is a tropical medicinal plant valued for its health benefits and air-purifying qualities. It thrives indoors under bright, indirect sunlight and moderate watering. Known for its therapeutic properties, it can help regulate blood sugar levels and improve overall indoor air quality. Its glossy foliage adds a lush, green touch to interiors, making it both functional and decorative. Regular care ensures steady growth and enhances its medicinal benefits. This plant is perfect for homes and offices, combining natural beauty with health-promoting attributes.",
    "image": "https://i.ibb.co.com/8DMJwtjm/medicinal-2.webp",
    "providerName": "GreenLeaf Nursery"
  }
]
